# Introduction
Integrate the data from actor and actress

## Imports
Import libraries and write settings here.

In [174]:
# Data manipulation
import pandas as pd
import numpy as np
import seaborn  as sns
import matplotlib.pyplot as plt
from time import gmtime, strftime
import ast
%matplotlib inline
#import nltk

In [252]:
#import pandas as pd
#df = pd.read_csv('export_df_div_dropna.csv')

df = pd.read_csv('export_df_div_dropna.csv')

In [253]:
df.columns

Index(['Unnamed: 0', 'name', 'bday', 'sex', 'age', 'age_diff', 'zodiac',
       'zodiac_sp', 'num_of_m', 'num_of_m_sp', 'num_of_child_cl',
       'num_of_child_sp_cl', 'num_of_role', 'num_of_role_sp', 'geohash',
       'geo_distance', 'age_m_1', 'age_div_1', 'age_m_sp_1', 'age_div_sp_1',
       'divorce'],
      dtype='object')

In [255]:
df['sex'].replace(['F','M'],[0,1],inplace=True)
df['sex'].head()

0    1
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

## Clean the dataset
Remove the following column:
'Unnamed: 0'

In [256]:
df = df.drop(['Unnamed: 0'], axis =1)

In [257]:
# Check the missing value (%)
print(df.shape)
(df.isnull().sum()*100 / len(df)).sort_values(ascending=False)

(3090, 20)

num_of_child_sp_cl    78.284790
age_div_sp_1          73.203883
age_m_sp_1            73.203883
num_of_m_sp           71.553398
age_diff              68.964401
num_of_role_sp        68.834951
zodiac_sp             68.414239
geo_distance          67.443366
age_div_1             56.601942
num_of_child_cl       34.660194
num_of_role            4.142395
age_m_1                2.750809
bday                   2.394822
zodiac                 2.394822
age                    2.394822
geohash                0.906149
num_of_m               0.355987
divorce                0.000000
sex                    0.000000
name                   0.000000
dtype: float64

### More preprocessing work
Calcualte the year of first marrage and first divoice

### Deal with missing data and prepare data for ML
Remove the rows associated with nan values in divorce column. Store the dataframe with these rows removed in df_div_rm.

In [258]:
# Check the missing value (%)
(df.isnull().sum()*100 / len(df)).sort_values(ascending=False)

num_of_child_sp_cl    78.284790
age_div_sp_1          73.203883
age_m_sp_1            73.203883
num_of_m_sp           71.553398
age_diff              68.964401
num_of_role_sp        68.834951
zodiac_sp             68.414239
geo_distance          67.443366
age_div_1             56.601942
num_of_child_cl       34.660194
num_of_role            4.142395
age_m_1                2.750809
bday                   2.394822
zodiac                 2.394822
age                    2.394822
geohash                0.906149
num_of_m               0.355987
divorce                0.000000
sex                    0.000000
name                   0.000000
dtype: float64

In [262]:
df_num_vars = df[['age','age_diff', 'zodiac','zodiac_sp','num_of_child_cl',
                         'num_of_child_sp_cl','num_of_role','num_of_role_sp','geo_distance',
                         'age_m_1','age_m_sp_1','sex']];

In [263]:
fill_mean = lambda col: col.fillna(col.mean())
df_num_vars = df_num_vars.apply(fill_mean, axis=0);
df_num_vars.shape

(3090, 12)

**2.** deal with missing values in catagories column

In [264]:
cat_df = df.select_dtypes(include=['object'])# Subset to a dataframe only holding the categorical columns

# Print how many categorical columns are in the dataframe - should be 147
cat_df.shape[1]

3

The categorical columns are 'name', 'sex', 'geohash', and 'bday'. ''name ' is unnessesary for ML analysis. 'bday' is redundant to 'age' and 'zodiac' , so I removed these two columns. Next, do the get_dummies on the 'geohash' column,

In [265]:
#Create a copy of the dataframe
df_cat_vars =  df[['geohash']]

#Pull a list of the column names of the categorical variables
var = df_cat_vars.columns


    # for each cat add dummy var, drop original column
df_cat_copy = pd.concat([df_cat_vars.drop(var, axis=1), \
                    pd.get_dummies(df_cat_vars[var], prefix=var, prefix_sep='_', drop_first=True,  dummy_na=True)], axis=1)

In [266]:
#df_X = pd.concat([df_cat_copy, df_sex], axis=1)
df_X = pd.concat([df_num_vars, df_cat_copy], axis=1)

In [273]:
#df_X = pd.DataFrame()
#df_X = df_X.drop_duplicates(keep='first') 
print(df_X.columns)

Index(['age', 'age_diff', 'zodiac', 'zodiac_sp', 'num_of_child_cl',
       'num_of_child_sp_cl', 'num_of_role', 'num_of_role_sp', 'geo_distance',
       'age_m_1',
       ...
       'geohash_wvuxp6g', 'geohash_wy7b1hn', 'geohash_wyd6fyj',
       'geohash_wydm9qy', 'geohash_xn6mfnb', 'geohash_xn76cyd',
       'geohash_xn76u57', 'geohash_xpttfun', 'geohash_z0me0j8', 'geohash_nan'],
      dtype='object', length=1187)

In [277]:
df_y = df[['divorce']]

In [278]:
# save data for ML
df_X.to_csv('export_df_X_forML.csv', header=True)
df_y.to_csv('export_df_y_forML.csv', header=True)

In [279]:
print(df_X.shape)

(3090, 1187)

In [280]:
print(df_y.shape)

(3090, 1)

In [281]:
df_X.head()

,age,age_diff,zodiac,zodiac_sp,num_of_child_cl,num_of_child_sp_cl,num_of_role,num_of_role_sp,geo_distance,age_m_1,...,geohash_wvuxp6g,geohash_wy7b1hn,geohash_wyd6fyj,geohash_wydm9qy,geohash_xn6mfnb,geohash_xn76cyd,geohash_xn76u57,geohash_xpttfun,geohash_z0me0j8,geohash_nan
0,58.810243,0.476636,6.000000,5.688525,2.000000,2.244411,5.0,2.511942,1.206643e+07,19.000000,...,0,0,0,0,0,0,0,0,0,0
1,64.776142,-2.165684,7.000000,9.000000,2.000000,2.000000,1.0,1.000000,2.000000e+07,28.000000,...,0,0,0,0,0,0,0,0,0,0
2,70.357546,0.476636,5.583223,5.688525,2.000000,2.244411,3.0,2.511942,1.206643e+07,30.055907,...,0,0,0,0,0,0,0,0,0,0
3,70.357546,0.476636,5.583223,5.688525,2.310054,2.244411,1.0,2.511942,1.206643e+07,30.055907,...,0,0,0,0,0,0,0,0,0,0
4,31.466765,0.476636,10.000000,5.688525,2.310054,2.244411,3.0,2.511942,1.206643e+07,26.000000,...,0,0,0,0,0,0,0,0,0,0

In [282]:
df_y.head()

   divorce
0      1.0
1      1.0
2      0.0
3      1.0
4      0.0